In [36]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import re
from datetime import datetime 
from time import time
from sklearn.preprocessing import OrdinalEncoder ,OneHotEncoder
from numpy import array
from numpy import asarray
from sklearn.preprocessing import StandardScaler
import xgboost as xgb
from scipy import stats

In [37]:
train_data=pd.read_csv("Train-Set.csv\\Train-Set.csv")
test_data=pd.read_csv("Test-Set.csv\\Test-Set.csv")
train_data.head(5)

,Unnamed: 0,id,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,Target
0,56963,31963,47,blue-collar,married,basic.9y,no,NaN,no,yes,cellular,apr,fri,583,2,999,1,failure,no
1,31753,21378,48,management,divorced,tertiary,no,351.0,yes,no,cellular,7,apr,725,3,-1,0,unknown,no
2,60854,17084,38,technician,single,high.school,no,NaN,no,no,cellular,aug,wed,74,2,999,0,nonexistent,no
3,34207,81693,50,management,divorced,tertiary,no,1270.0,yes,no,cellular,4,may,24,3,-1,0,unknown,no
4,73066,63978,54,self-employed,married,high.school,no,NaN,yes,yes,cellular,aug,thu,904,3,999,0,nonexistent,yes

In [5]:
train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54712 entries, 0 to 54711
Data columns (total 19 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  54712 non-null  int64
 1   id          54712 non-null  int64
 2   age         54712 non-null  int64
 3   job         54712 non-null  object
 4   marital     54712 non-null  object
 5   education   54712 non-null  object
 6   default     54712 non-null  object
 7   balance     31842 non-null  float64
 8   housing     54712 non-null  object
 9   loan        54712 non-null  object
 10  contact     54712 non-null  object
 11  day         54712 non-null  object
 12  month       54712 non-null  object
 13  duration    54712 non-null  int64
 14  campaign    54712 non-null  int64
 15  pdays       54712 non-null  int64
 16  previous    54712 non-null  int64
 17  poutcome    54712 non-null  object
 18  Target      54712 non-null  object
dtypes: float64(1), int64(7), object(11)
memory usage: 7.9+ MB

In [20]:
train_data['Target'].value_counts()

no     48433
yes     6279
Name: Target, dtype: int64

the data is unbalanced

In [7]:
train_data['job'].value_counts()

blue-collar      12042
admin.            9346
technician        9122
management        8292
services          5148
retired           2557
self-employed     1883
entrepreneur      1876
unemployed        1463
housemaid         1457
student           1150
unknown            376
Name: job, dtype: int64

In [8]:
train_data['marital'].value_counts()

married     33095
single      15362
divorced     6209
unknown        46
Name: marital, dtype: int64

In [9]:
train_data['education'].value_counts()

secondary              16357
tertiary                9313
university.degree       6741
high.school             5292
primary                 4854
basic.9y                3380
professional.course     2925
unknown                 2276
basic.4y                2256
basic.6y                1306
illiterate                12
Name: education, dtype: int64

In [10]:
train_data['housing'].value_counts()

yes        29666
no         24503
unknown      543
Name: housing, dtype: int64

In [12]:
train_data['contact'].value_counts()

cellular     35134
telephone    10424
unknown       9154
Name: contact, dtype: int64

In [11]:
train_data['loan'].value_counts()

no         45564
yes         8605
unknown      543
Name: loan, dtype: int64

In [40]:
train_data['balance'][train_data['balance']==None]

Series([], Name: balance, dtype: float64)

In [24]:

columns_to_remove = ['Unnamed: 0', 'id', 'poutcome', 'day', 'month']

# Using pop() in a loop to remove multiple columns
train_data = train_data.drop(columns=columns_to_remove)

#drop column from test data
test_data=test_data.drop(columns=columns_to_remove)


train_data=train_data.drop_duplicates()

In [4]:
print(train_data.isna().sum(),'\n')
print(test_data.isna().sum())

Unnamed: 0        0
id                0
age               0
job               0
marital           0
education         0
default           0
balance       22870
housing           0
loan              0
contact           0
day               0
month             0
duration          0
campaign          0
pdays             0
previous          0
poutcome          0
Target            0
dtype: int64

Unnamed: 0        0
id                0
age               0
job               0
marital           0
education         0
default           0
balance       10080
housing           0
loan              0
contact           0
day               0
month             0
duration          0
campaign          0
pdays             0
previous          0
poutcome          0
dtype: int64